/**
 * 正则表达式定义
 * @author 田尘殇Sean(sean.snow@live.com)
 * @date 2016/10/26
 */
export const Pattern = {
  /**
   * 营业执照
   */
  businessLicense: /(^(?:(?![IOZSV])[\dA-Z]){2}\d{6}(?:(?![IOZSV])[\dA-Z]){10}$)|(^\d{15}$)/,
  /**
   * 邮箱
   */
  email: /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/,
  /**
   * 手机号,兼容电话
   */
  mobilePhone: /^(0[0-9]{2,3}\-)?([2-9][0-9]{6,7})+(\-[0-9]{1,4})?$|(^1(3|4|5|7|8)\d{9}$)/,
  /**
   * 中文名,
   * 2-4位的中文名
   */
  chineseName: /^[\u4e00-\u9fa5]+$/,
  /**
   * 15 / 18 位身份证
   */
  idCard: /(^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$)|(^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|X)$)/,

  password: /((?=.*\d)(?=.*\D)|(?=.*[a-zA-Z])(?=.*[^a-zA-Z]))^.{6,20}$/,

  /**
   * 货币正则表达式
   */
  currency: /((^[-]?([1-9]\d*))|^0)(?:\.\d{0,2})?$|(^[-]0\.\d{1,2}$)/,

  chinese: /^[\u4e00-\u9fa5]+$/,

  /**
   * 银行卡号
   */
  cardNo: /^([1-9]{1})(\d{15}|\d{16}|\d{18})$/
};

export default Pattern;
