export const provinces = [
  {
    "code": "156410000",
    "name": "河南省"
  },
  {
    "code": "156330000",
    "name": "浙江省"
  },
  {
    "code": "156460000",
    "name": "海南省"
  },
  {
    "code": "156710000",
    "name": "台湾省"
  },
  {
    "code": "156620000",
    "name": "甘肃省"
  },
  {
    "code": "156420000",
    "name": "湖北省"
  },
  {
    "code": "156120000",
    "name": "天津市"
  },
  {
    "code": "156150000",
    "name": "内蒙古自治区"
  },
  {
    "code": "156450000",
    "name": "广西壮族自治区"
  },
  {
    "code": "156320000",
    "name": "江苏省"
  },
  {
    "code": "156370000",
    "name": "山东省"
  },
  {
    "code": "156110000",
    "name": "北京市"
  },
  {
    "code": "156540000",
    "name": "西藏自治区"
  },
  {
    "code": "156630000",
    "name": "青海省"
  },
  {
    "code": "156500000",
    "name": "重庆市"
  },
  {
    "code": "156820000",
    "name": "澳门特别行政区"
  },
  {
    "code": "156220000",
    "name": "吉林省"
  },
  {
    "code": "156350000",
    "name": "福建省"
  },
  {
    "code": "156440000",
    "name": "广东省"
  },
  {
    "code": "156310000",
    "name": "上海市"
  },
  {
    "code": "156360000",
    "name": "江西省"
  },
  {
    "code": "156810000",
    "name": "香港特别行政区"
  },
  {
    "code": "156230000",
    "name": "黑龙江省"
  },
  {
    "code": "156140000",
    "name": "山西省"
  },
  {
    "code": "156530000",
    "name": "云南省"
  },
  {
    "code": "156510000",
    "name": "四川省"
  },
  {
    "code": "156340000",
    "name": "安徽省"
  },
  {
    "code": "156640000",
    "name": "宁夏回族自治区"
  },
  {
    "code": "156210000",
    "name": "辽宁省"
  },
  {
    "code": "156430000",
    "name": "湖南省"
  },
  {
    "code": "156610000",
    "name": "陕西省"
  },
  {
    "code": "156130000",
    "name": "河北省"
  },
  {
    "code": "156650000",
    "name": "新疆维吾尔自治区"
  },
  {
    "code": "156520000",
    "name": "贵州省"
  }
]
